
//     Описание задачи: Напишите функцию, которая разворачивает массив в обратном порядке.
//     Ожидаемый результат: [1, 2, 3] => [3, 2, 1]

// const array = [1,2,3]
// console.log(array.reverse())

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////


// Описание задачи: Напишите функцию, которая очищает массив от нежелательных значений,
//     таких как false, undefined, пустые строки, ноль, null.
//     Ожидаемый результат: [0, 1, false, 2, undefined, '', 3, null] => [1, 2, 3]

// const array = [0,1,false,2,undefined,'',3,null]
// const result = array.filter(function (n){
//     return !!n
// })
// console.log(result)

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//   Описание задачи: Напишите функцию, которая убирает повторяющиеся значения.
//   Ожидаемый результат: [1, 2, 3, 1, 2] => [1, 2, 3]

// const array = [1, 2, 3, 1, 2]
// const result = array.reduce((prev, cur) => (prev.indexOf(cur) === -1) ? [...prev, cur] : prev, [])
// console.log(result)


////////////////////////////////////////////////////////////////////////////////////////////////////////////////


//   Даны два массива: ['a', 'b', 'c'] и [1, 2, 3]. Объедините их вместе.

// const array = ['a', 'b', 'c']
// const array2 = [1, 2, 3]
// const newArr = [...array , ...array2]
// console.log(newArr)

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//    Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.
//    Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.

// const array = [1, 2, 3]
//
// // const startArr = [4, 5, 6,...array]
// // console.log(startArr)
//
// // const endArr = [...array, 4, 5, 6]
// // console.log(endArr)

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//    Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].

// const array = [1, 2, 3, 4, 5]
// array.splice(1,2)
// console.log(array)

///////////////////////////////////////////////////////////////////////////////////////////////////////////////

//   Дан объект {js:'test', jq: 'hello', css: 'world'}. Получите массив его ключей.

// const  array = {js:'test', jq: 'hello', css: 'world'}
// console.log(Object.keys(array))

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//     Напишите код, который преобразовывает и объединяет все элементы массива в одно строковое значение.
//     Элементы массива будут разделены запятой.
//
//     ['Капуста', 'Репа', 'Редиска', 'Морковка']

// const array =  ['Капуста', 'Репа', 'Редиска', 'Морковка']
// const newString = array.toString()
// console.log(newString)
// console.log(array.join())

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////

    // Пользователь вводит строку кириллицей разного регистра.
    // Напишите функцию, которая принимает строку в качестве аргумента и заменяет регистр каждого символа
    //  на противоположный. Например, если вводится «КаЖдЫй ОхОтНиК», то на выходе должен быть массив [кАжДыЙ оХоТнИк]

// function change(text){
//     return text.split('').map(el => el === el.toLowerCase() ? el.toUpperCase() : el.toLowerCase()).join('')
// }
// console.log(change('КаЖдЫй ОхОтНиК'))


////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

    // Напишите код, который создаёт массив элементов представляющих собой сумму соответствующих
    // элементов заданных массивов.
//     arr1 = [1, 2, 3, 4, 5];
//     arr2 = [4, 5, 6]

// const arr1 = [1, 2, 3, 4, 5]
// const arr2 = [4, 5, 6]
// const array = [...arr1,...arr2]
// const sum = array.reduce(function (a ,b ){
//     return a + b
// })
// console.log(sum)
